# Insertion sort
# Сортировка вставками



import random

n = 50
arr = list()
for i in range(n):
    number = random.randint(1, 100)
    arr.append(number)
    
print('Not sorted: ')
print(arr)
print('----------')

############################################################    
'''
___________________________________
index[i] 0 1 2 3 
         -------
   #n =  6 5 3 4
   
29.  i = 1
30.  j = 0
31.  5 < 6
32.  [6 6 3 4]       
33.  j = -1
34.  arr[0] = 5
35.  #n = 3 5 6 4
_____________________________________
'''

for i in range(n):
    val = arr[i] # сохраняем элемент с которым работаем 'i'
    j = i - 1 # отсортированные элементы
    while (val < arr[j] and j >= 0): # < сортировка от меньшего к большему. > сортировка от большего к меньшему
        arr[j + 1] = arr[j]
        j -= 1
    arr[j + 1] = val
       
############################################################ 

print('Sorted: ')
print(arr)
    